{
    "lessons": {
        "syllable": {
            "title": "Apprendre la syllabe",
            "description": "Découvre comment sont construites les syllabes en coréen et comprends le rôle des batchims (consonnes finales) et gyeobatchims (doubles consonnes finales).",
            "chapters": [
                {
                    "title": "Construire une syllabe",
                    "description": "Ce chapitre explique les règles de base pour construire un bloc syllabique en Hangeul.",
                    "rulesTitle": "Les règles concernant la construction de syllabes",
                    "rules": [
                        "Un bloc de syllabe est au moins constitué de deux lettres (ex : consonne + voyelle).",
                        "Chaque syllabe commence par une consonne. Si une syllabe commence par une voyelle, on utilise 이응 (ㅇ) comme consonne muette.",
                        "Une consonne est toujours suivie d'une voyelle.",
                        "Chaque bloc de syllabe occupe le même espace carré pour garder une écriture harmonieuse."
                    ],
                    "examples": [
                        "Bloc de 3 lettres (han)",
                        "Syllabe commençant avec ㅇ (a)",
                        "Consonne + voyelle (ga)",
                        "Horizontal",
                        "Vertical"
                    ],
                    "constructionTitle": "Construction des syllabes",
                    "constructionDescription": "Les voyelles verticales sont écrites à droite de la consonne. Les voyelles horizontales sont écrites en dessous de la consonne."
                },
                {
                    "title": "Batchims et Gyeobbatchims",
                    "description": "Ce chapitre présente les batchims (consonnes finales) et les gyeobbatchims (doubles consonnes finales), avec des règles et conseils de prononciation.",
                    "introTitle": "Introduction",
                    "introTextParts": [
                        "Les consonnes de fin de syllabe sont appelées batchims et gyeobbatchims (겹받침 en coréen).",
                        "Elles se placent en fin de syllabe et ont une prononciation différente de leur position initiale.",
                        "Toute syllabe comportant",
                        "au moins trois lettres",
                        "peut avoir une consonne finale."
                    ],
                    "batchimTitle": "Batchims",
                    "batchimText": "On appelle batchims les consonnes finales simples. Exemples et prononciations :",
                    "batchimTableHeaders": [
                        "Consonne finale",
                        "Prononciation"
                    ],
                    "gyeobbatchimTitle": "Gyeobbatchims",
                    "gyeobbatchimTextParts": [
                        "Les gyeobbatchims (겹받침) sont des doubles consonnes finales.",
                        "Il existe 11 combinaisons :",
                        "En général, seule la première consonne est prononcée.",
                        "Exceptions : ㄺ, ㄻ, ㄼ où l’on prononce la deuxième."
                    ],
                    "liaisonTitle": "Consonnes finales suivies d'une voyelle",
                    "liaisonText": "Quand un batchim ou gyeobbatchim est suivi d’une syllabe commençant par une voyelle, le son bascule vers la syllabe suivante.",
                    "word": "Exemple",
                    "phonetic": "Phonétique",
                    "translation": "Traduction",
                    "pronunciation": "Prononciation",
                    "pronunced": "se prononce"
                }
            ]
        }
    }
}